package com.example.bodymassindex;

import java.util.Arrays;
import java.util.List;

public class TextList {
    List<String> underWeight = Arrays.asList(
            "Если ИМТ меньше 19,0, то это говорит о недостаточном весе. Недостаточный вес может",
            "привести к проблемам с зачатием ребенка, к отсутствию месячных, остеопорозу, а также",
            "постоянному стрессовому состоянию из-за непривлекательного внешнего вида. В некоторых",
            "случаях может наблюдаться не усвоение питательных веществ."
    );
    List<String> normalWeight = Arrays.asList(
            "Если ИМТ 19,0 – 24,0, то ваш вес нормальный. Такой вес считается идеальным и не несет",
            "опасности для здоровья. Худеть или поправляться при таком весе не стоит, однако",
            "некоторые корректировки фигуры в косметических целях желательно. Если при таком весе",
            "обхват талии у вас превышает 80 см, то вероятно появление избыточного веса в будущем.",
            "В этом случае необходимо заниматься физическими упражнениями для развития мышечной массы."
    );
    List<String> overWeight = Arrays.asList(
            "Если ИМТ 24,0- 30,0, то у вас имеется избыточный вес. Постарайтесь срочно избавиться",
            "от него, поскольку при таком ИМТ возникает риск развития заболеваний ",
            "сердечно-сосудистых системы, диабета. Часто отмечается повышенное давление. ",
            "Рекомендуем при таком ИМТ поменять образ жизни, придерживаться диеты и отказаться от",
            "употребления жирных, сладких и высококалорийных продуктов. Много времени уделяйте",
            "физическим упражнениям, ходьбе и бегу."
    );
    List<String> obesity = Arrays.asList(
            "Если ИМТ 30,0 – 35,0, то у вас ожирение I степени. Ожирение – это опасное заболевание,",
            "оно говорит о высоком содержании жира в организме. Если вы измерите давление, то ",
            "наверняка оно у вас выше нормы, вы очень быстро устаете, предпочитаете сидеть в",
            "автобусе или во время беседы. Вам трудно уснуть, потому что вы чувствуете себя",
            "голодным. Срочно начинайте заниматься собой, выберите подходящую для вас диету и образ",
            "жизни. Питание, свой вес и занятия спортом строго контролируйте. Не позволяйте себе",
            "поддаваться лени и не ищите причины, по которым у вас нет времени заниматься собой.",
            "Здоровье важнее всего, а вам как раз и пора задуматься об этом. У вас большой риск ",
            "развития сердечно-сосудистых заболеваний, диабета и болезней ног.",
            "Если ИМТ 35,0 – 40,0, то это говорит об ожирении II степени. Настоятельно рекомендуем",
            "срочно снизить вес, если не можете самостоятельно обратитесь к диетологам. Начинайте",
            "посещать оздоровительные курсы для снижения веса, покупайте диски с программой для",
            "самостоятельного снижения веса, посещайте спорт-клубы. Постепенно уменьшайте количество",
            "потребляемой пищи, считайте калории и записывайте их. Для женщин количество",
            "потребляемой калорий должно составлять 1000-1500 ккал. в день. Старайтесь добиться",
            "отказа от употребления пищи больше этой нормы. При таком ИМТ резко возрастает риск",
            "развития болезней, приводящих к преждевременной смерти."
    );
    List<String> extrimeObesity = Arrays.asList(
            "Если ИМТ более 40,0, то это опасное ожирение III степени. К сожалению, похудеть ",
            "самостоятельно при таком ожирении очень трудно, так как уже произошли непоправимые",
            "изменения в организме. Страдают от ожирения все органы, в первую очередь сердце, почки,",
            "опорно-двигательный аппарат. Наблюдается одышка, проблемы при ходьбе с ногами,",
            "невозможно согнуться. Лечение ожирения III степени необходимо проводить под наблюдением",
            "врача-диетолога, а самостоятельно необходимо стараться снизить вес до более приемлемых",
            "показателей. Попробуйте ходить не менее двух часов пешком быстрым ходом, если позволяет",
            "вам здоровье."
    );

}
